import math


def area(r):
    return math.pi * r * r
'''
    Вычисляет площадь круга по заданному радиусу.
        Параметры:
            r (float) - радиус круга
        Возвращаемое значение:
            (float) - площадь круга 
        Пример вызова 
            
'''

def perimeter(r):
''''
    Вычисляет длину окружкости по заданному радиусу:
        Параметры:
            r (float) - радиус круга
        Возвращаемое значение:
            float - длина окружности
        Пример вызова
'''
    return 2 * math.pi * r

